[Language]
Code="fi"
Name="Finnish"
Version="2.8.1"
Translator="Veikko Muurikainen <veikko.muurikainen@kolumbus.fi>"
Dir="ltr"

[MainFrame]
Title="Lingoes"
Close="Sulje"
Maximize="Suurenna"
Minimize="Pienennä"
Restore="Palauta"
Menu="Päävalikko"

[NotifyIcon]
Tip="Lingoes\nKaappaa sana ruudulta: [$CursorStatus]\nKäännä valittu teksti: [$SelectionStatus]\nKäännä leikepöydän teksti: [$ClipboardStatus]"
InfoTitle="Lingoes"
Info="Kaappaa sana ruudulta: [$CursorStatus]\nKäännä valittu teksti: [$SelectionStatus]\nKäännä leikepöydän teksti: [$ClipboardStatus]"
Enabled="Käytössä"
Disabled="Ei käytössä"

[MainMenu]
Open=Avaa
CursorTranslator="Kaappaa sana ruudulta"
SelectionTranslator="Käännä valittu teksti"
ClipboardTranslator="Käännä leikepöydän teksti"
Configuration="Asetukset"
Dictionaries="Sanastot"
Appendices="Liitteet"
Activation="Tuoteaktivointi"
UpdateOnline="Päivitä verkossa"
Help="Ohje"
About="Tietoja"
SupportOnline="Tuotetuki"
Exit="Poistu"
EnterLicense="Anna lisenssi"
[DlgInput]
Back="Takaisin"
Forward="Seuraava"
MainMenu="Päävalikko"
HistoryList="Historialista"
Search="Etsi", "Etsi yksityiskohtaisia selvityksiä"
WebSearch="Verkkohaku"
AutoMatch="Autovertailu", "Sovita yhteen indeksiryhmässä"
MatchSetup="Indeksiryhmän asetukset..."
FindEngine="Hae lisää Internet-sanastoja..."

[DlgIndex]
Index="Indeksi"
Guide="Opas"
Appendix="Liitteet"
NoIndex="Ei hakemistoa"
AdIndexGroup="<div style=\"margin: 10; font-family: '[$TextFont]'; font-size: [$TextFontSize]pt\">Lisää sanasto <b>Indeksiryhmään</b>, Saat oikeinkirjoitusehdotuksen kirjoittaessasi.<br/><br/><a href=\"app://dictionary_group/[$IndexGroupID]\"><u>Voit hallita indeksiryhmää tästä.</u></a></div>"

[WebGuide]
Results="Tulokset"
Spelling="Oikeinkirjoitus"
Appendices="Liitteet"
Options="Asetukset"
Dictionaries="Sanastot...", "Hallinnoi sanastoja"
ManageAppendices="Liitteet...", "Hallinnoi liitteitä"
Configuration="Asetukset...", "Avaa määritysikkuna"
Help="Ohje", "Avaa Lingoes-ohje"
Homepage="lingoes.net", "Vieraile Lingoes-sivuilla"
Community="Lingoes-yhteisö", "Lingoes verkkoyhteisö"

[DlgAppendix]
WndTitle="Liitteiden asetukset"
Close="Sulje"
Install="Asennus", "Lingoes liitteet (*.laf)|*.laf|", "Asennus epäonnistui! \nEhkä sinulla ei ole riittäviä tiedostojen käyttöoikeuksia."
Delete="Poisto", "Haluatko varmasti poistaa \"[$Title]\"", "\"[$Title]\" poisto epäonnistui! \nEhkä sinulla ei ole riittäviä tiedostojen käyttöoikeuksia."
Modify="Muokkaa", "Muokkaus epäonnistui! \nEhkä sinulla ei ole riittäviä tiedostojen käyttöoikeuksia."
NewGroup="Uusi ryhmä", "Uuden ryhmän luominen ei onnistunut! \nEhkä sinulla ei ole riittäviä tiedostojen käyttöoikeuksia."
MoveUp="Siirrä ylös"
MoveDown="Siirrä alas"
CreateAppendix="Luo oma Liite"
Download="Hae liitteitä"
Name="Nimi"
Group="Ryhmä"
InstallSucceed="\"[$Title]\" Asennus onnistui."
OverwriteInstall="Liite on jo olemassa, korvataanko?\n\nOtsikko:[$Title]\nNimi: [$Name]"
InvalidInstallFile="Epäkelpo asennustiedosto!\n[$Filename]"
AppeVersionTooOld="[$Filename]\nLiitteen versio on vanhentunut ([$AppeVer]), päivitä.\n\nKäy Lingoes-verkkosivuilla hakemassa uusin versio?"
AppeVersionTooNew="[$Filename]\nSanasto ([$AppeVer]) vaatii uudemman Lingoes-version.\n\nLataa uusin versio Lingoes-sivustolta nyt?"

[DlgAppendixEdit]
WndTitle="Muokkaa \"[$Title]\"", "Luo uusi ryhmä"
Name="Nimi"
DisplayTitle="Otsikko"
DisplayStyle="Tyyli"
Ok="OK"
Cancel="Peruuta"

[DlgAppendixBuilder]
WndTitle="Liitteen muodostin"
Name="Nnimi: (Vain a-z, 0-9, tavuviiva ja alaviiva)", "Nimi tarvitaan, salli vain a-z, 0-9, tavuviiva ja alaviiva."
Title="Otsikko:", "Otsikko tarvitaan!"
Location="Projektikansion sijainti:", "Projektikansioon luonti epäonnistui!", "Valitse käytettävissä oleva kansio"
Create="Luo uusi projekti", "Onnistunut projektin luonti!\n\nNyt voit suunnitella liitteen vapaasti muokkaamalla \"index.html\" tiedostoa.", "Projektin luonti epäonnistui!"
Build="Build", "Onnistunut liitetiedoston luonti!\n[$Filename]", "Liitetiedoston luonti epäonnistui!\n[$Filename]"
Close="Sulje"
Tips="Vinkit: Voit suunnitella liitteen vapaasti muokkaamalla \"index.html\" tiedostoa  uuden projektin luomisen jälkeen."
OverwriteProject="Projektitiedosto on olemassa, korvataanko se?"

[DlgStatus]
KeepVisible="Pidä ikkuna aina päällimmäisenä"
CursorTranslator=""
SelectionTranslator=""
ClipboardTranslator=""
OpenMiniWnd="Avaa/Sulje mini-ikkuna"

[DlgView]
Speak="Sano se", "Puhu valittu teksti"
Search="Etsi"
Copy="Kopioi"
Print="Tulosta..."
Save="Tallenna..."
Find="Hae..."
SelectAll="Valitse kaikki"
TextTranslate="Tekstikäännös", "Käynnistä Tekstikäännös"
StartPage="Aloitussivu", "Aloitussivu"
ShowIndex="Näytä sivupalkki"
HideIndex="Piilota sivupalkki"
SaveFilter="HTML tiedosto (*.htm; *.html)|*.htm;*.html|"
SpeechOption="Puheen vaihtoehdot..."
SelectVoice="Valitse ääni"
Activation="Aktivointi", ""
Buy="Osta", "Osta Lingoes kaupallinen lisenssi"

[DlgRegister]
Title="Lingoes - Kaupallinen käyttäjän Rekisteröinti"
FreeDownload="Lingoes on ilmainen ei-kaupallisiin tarkoituksiin.\r\nLataa ilmainen versio tästä..."
Name="Rekisteröinti nimi:", "Rekisteröinti nimi on tarpeen"
Email="Rekisteröi sähköpostiosoite:", "Sähköpostiosoitteen rekisteröinti on tarpeen"
RegCode="Rekisteröinti koodi:", "Rekisterikoodi on virheellinen"
Support="Asiakaspalvelu"
Register="Rekisteröinti", "Rekisteröintitietojen tallennus epäonnistui"
Exit="Poistu"

[DlgInfo]
Title="Viesti"
Ok="Ok"
Cancel="Peruuta"
Yes="Kyllä"
No="Ei"
Retry="Yritä"
Abort="Keskeytä"
Ignore="Ohita"

[DlgAuthentication]
Title="Yhdistä"
TitleProxy="Yhdistä välityspalvelin"
Username="Käyttäjätunnus:"
Password="Salasana:"
Remember="Muista salasanani"
Ok="Ok"
Cancel="Peruuta"

[WndGrab]
Open="Etsi yksityiskohtaisia selvityksiä"
Speak="Sano se"
Copy="Kopioi"
TextTranslation="Tekstikäännös"
Back="Takaisin" 
Forward="Eteenpäin"
Search="Etsi\n  Enter:\t\tEtsi\n  Ctrl + Enter:\tEtsi yksityiskohtaisia selvityksiä\n  Shift + Enter:\tTekstikäännös\n  Alt + Enter:\tVerkkohaku"
RollUp="Pienennä/Palauta ikkuna"
Option="Valinta"
KeepVisible="Pidä ikkuna aina päällimmäisenä"
KeepSize="Pidä ikkunan koko"
AutoRollUp="Automaattinen rullaus", "Ei", "[$DelaySecond] sekunnin viive"
CloseMiniWnd="Sulje mini-ikkuna"

[DlgDictOption]
Title="Sanakirja-asetukset"
NetInstall="Lataa Lingoesilta", "Lataa sanasto lingoes-sivustolta"
Install="Asenna", "Asenna sanakirja levyltä"
Uninstall="Poista", "Poista sanakirja"
Add="Lisää", "Lisää sanakirja luetteloon"
Remove="Poista", "Poista tämä sanakirja listalta"
Download="Lataa", "Lataa tämä sanakirja yhteydettömään-käyttöön"
MoveTop="", "Siirrä ylimmäksi"
MoveUp="", "Siirrä ylös"
MoveDown="", "Siirrä alas"
MoveBottom="", "Siirrä alimmaksi"
MoreDetails="", "Näytä sanakirjan tiedot"
Sulje="Sulje"

Installed="Asennetut sanakirjat"
Query="Asennetut sanakirjat"
Index="Indeksiryhmä"
Grab="Tekstikaappaus ryhmä"

InstalledList="Asennetut sanakirjat"
QueryList="Asennetut sanakirjat"
IndexList="Indeksiryhmien luettelo"
GrabList="Tekstikaappausten ryhmäluettelo"
DictID="ID"
Online="Verkossa"

Type="Tyyppi"
OnlineType="Vaaditaan Internet-yhteys"
NotLicensed="(Not Licensed <a href='app://activate/'><u>Activate</u></a> <a href='app://buy/[$ProductID]'><u>Purchase</u></a>)"

AddFilter="Lingoes sanastot (*.ld2, *.ldp)|*.ld2;*.ldp|"
InstallDict="Asenna sanakirja"
Installing="Asennetaan..."
IndexDictTooMany="Vinkit:\n\nLisäämällä liikaa sanakirjoja osaksi \"Index Group\" hidastaa vastaavien sanojen löytymisen kirjoitettaessa hakukenttään.\n\nJoten suosittelemme, että lisäät vain muutamia usein käytettyjä sanakirjoja \"Index Group\"."

More="", "Lisää..."
BackupFilter="Lingoes sanastojen varmuuskopiot (*.ldb)|*.ldb|"
Export="Vie", "Vie sanakirjoja varmuuskopiotiedostoon", "Varmuuskopiointi onnistui!", "Varmuuskopiointi epäonnistui!"
Import="Tuo", "Tuo sanakirjoja varmuuskopiotiedostosta", "Tuonti onnistui!", "Tuonti epäonnistui!"

[DlgDictList]
Title="Lisää sanakirja"
Add="Lisää"
Cancel="Peruuta"
Select="Valitse"
DictList="Asennetut sanakirjat"
ID="ID"
Online="Verkossa"

[DlgDictInfo]
Title="Sanakirjan yksityiskohdat"
Close="Ok"

ID="ID"
MD5="MD5"
Tag="Tunnisteet"
Name="Nimi"
Version="Versio"
Date="Luontipäivämäärä"
Update="Viimeksi päivitetty"
IndexCount="Sanoja yhteensä"
Language=Kieli
MoreLanguage=Lisää..
DictTitle="Otsikko"
DictEdition="Painos"
DictDescription="Kuvaus"
PubAuthor="Tekijä"
PubPress="Paino"
PubEmail="Sähköposti"
PubWebsite="Verkkosivusto"
PubCopyright="Tekijänoikeudet"
Filename="Tiedostonimi"

; Install Dictionaries
[DlgDictInstall]
Title="Asenna sanakirja"
InstallSucceed="Onnistunut sanakirjan asennus \"[$DictTitle]\""
DictGroupOption="Valinnat"
AddIndexGroup="Lisää kohteeseen \"Index Group\""
AddIndexGroupDesc="Lingoes etsii sanakirjoja indeksiryhmästä ja kysyy lähintä tulosta indeksipalkissa kirjoittaessasi termiä."
AddGrabGroup="Lisää kohteeseen \"Tekstin kaappausryhmä\""
AddGrabGroupDesc="Lingoes etsii Tekstin kaappausryhmästä sanakirjoja ja näytää käännöstuloksen teksti-ikkunassa tekstiä kaapatessa."
Ok="Ok"

LoadPackage="Lataa sanakirja-paketti:\n"
LoadPackageFail="Sanakirja-paketin lataus epäonnistui:\n"
ExtractFileFail="Tiedoston purkaminen epäonnistui:\n"
OpenSetup="Avaa asennustiedosto:\n"
OpenSetupFail="Asennustiedoston avaus epäonnistui:\n"
FileFormatInvalid="Tiedostomuoto ei ole oikein:\n"
VersionInvalid="Versio ei tue:\n"
InstallDict="Asenna sanakirjatiedosto:\n"
InstallDictFail="Sanastotiedoston asennus epäonnistui:\n"
InstallPackageSucceed="Sanakirjapaketin asennus onnistui\n"

; Configuration
[DlgOption]
Title="Asetukset"
Ok="Ok"
Cancel="Peruuta"
General="Yleiset"
Appearance="Ulkoasu"
Connection="Yhteys"
Speech="Puhe"
Hotkey="Pikanäppäimet"
Translate="Käännös"
License="Lisenssit"
Capture="Tekstin kaappaus"

; General
[DlgOptGeneral]
Language="Kieli"
UILanguage="Käyttöliittymän kieli"

WebSearch="Verkkohaku"
SelectWebSearch="Valitse hakukone verkkohaulle"

TermHistory="Historia && Välimuisti"
SaveHistory="Historiaan tallennetut etsinyt sanat"
ClearHistory="Tyhjennä historia"
ClearHistoryConfirmation="Oletko varma että haluat tyhjentää sanahistorian?"

ResultCache="Verkkosanakirjan paikallinen välimuisti"
ClearCache="Tyhjennä välimuisti", "Oletko varma, että haluat tyhjentää välimuistin?"

AutoStart="Käynnistä Lingoes Windowsiin kirjauduttaessa"
StartMin="Pienennä käynnistyksen jälkeen"
HideTipWnd="Älä näytä vihjeikkunaa"

; Appearance
[DlgOptAppearance]
UserInterface="Käyttöliittymä"
WindowStyle="Ikkunan tyyli"
WindowFont="Tekstikirjasin"
WindowFontSize="Fontin koko"
WindowFontSizeList="7", "8", "9", "10", "10.5", "11"
ResultDisplay="Tulosnäyttö"
TextFont="Tekstikirjasin"
TextFontSize="Fontin koko"
TextFontSizeList="7", "8", "9", "10", "10.5", "11", "12", "13", "14", "16", "18", "20", "22", "24", "26", "28", "32", "36", "48"
PhoneticFont="Foneettinen kirjasin"
CursorTranslatorBar="Teksti-ikkuna"
FontColor="Fontin väri"
BackColor="Taustaväri"
BorderColor="Reunan väri"
Transparence="Läpikuultavat teksti-ikkunat"
SampleText="Tekstikaappaus"

[Style]
0="Ei mitään"
1="Oletus"

; Translate
[DlgOptTranslate]
SupportLCMap="Paikallisen kielen kartoitustuki"
InstantTranslation="Välitön käännös"
TranslationEngine="Käännöskone"
TargetLanguage="Kohdekieli:"
CurrentUserLanguage="= Nykyinen käyttäjäkieli"
TargetLanguage2="Jos kohdekieli on sama kuin lähde, muuta se: "
NoTranslate="= Ei käännöstä"

;--------- For Compatible 2.4.2 and older ----------------
CursorActivation="Kaappaa sana näytöltä"
MouseActivation="Hiiren aktivointitila:"
MouseOver="Sanan päällä"
LeftMouseButton="Hiiren vasen painike"
MiddleMouseButton="Hiiren keski painike"
RightMouseButton="Hiiren oikea painike"
MouseXButton1="Hiiren X painike 1"
MouseXButton2="Hiiren X painike 2"
TimeDelay="Viive:"
MSEL="millisekuntia"
IgnoreNumber="Ohita numerot"
IgnoreLatin="Ohita latinalaiset (englanti, ranska, saksa, espanja, jne.)"
IgnoreCJK="Ohita kiinalaiset, japanilaiset ja korealaiset"
IgnoreCyrillic="Ohita kyrilliset (venäjä, ukraina, bulgaria, jne.)"
IgnoreArabic="Ohita arabia, heprea"
InstallAdobePlugin="Asenna Adobe Acrobat PDF laajennus"
ZonedWord="Käännä valittu teksti"
ZonedWordFilterRule="Suodattimen säännöt tekstivalintaan..."
;----------- end --------------------

; Capture
[DlgOptCapture]
CursorActivation="Kaappaa sana näytöltä"
MouseActivation="Hiiren aktivointitila:"
MouseOver="Sanan päällä"
LeftMouseButton="Hiiren vasen painike"
MiddleMouseButton="Hiiren keski painike"
RightMouseButton="Hiiren oikea painike"
MouseXButton1="Hiiren X Painike 1"
MouseXButton2="Hiiren X Painike 2"
TimeDelay="Viive:"
MSEL="millisekuntia"
MatchPhrase="Sovita lause"
IgnoreNumber="Ohita numerot"
IgnoreLatin="Ohita latinalaiset (englanti, ranska, saksa, espanja, jne.)"
IgnoreCJK="Ohita kiinalaiset, japanilaiset ja korealaiset"
IgnoreCyrillic="Ohita kyrilliset (venäjä, ukraina, bulgaria, jne.)"
IgnoreArabic="Ohita arabia, heprea"
ZonedWord="Käännä valittu teksti"
ForTextSelection="Tekstivalinta kohteesta"
ForDoubleClicking="Kaksoisklikkaamalla"
ZonedWordFilterRule="Suodattimen säännöt tekstivalintaan..."
ShowOnlyFirstResult="Näytä vain ensimmäinen hakutulos"
InstallTextCapturePlugin="Asenna tekstikaappaus laajennus..."
InstallAdobePlugin="Asenna Adobe Acrobat PDF laajennus"
InstallFirefoxPlugin="Asenna Firefox 4+ laajennus"
InstallChromePlugin="Asenna Chrome laajennus"
Install360ChromePlugin="Asenna 360Chrome laajennus"

; Capture - Text Selection Filter
[DlgOptTranslateZWFilter]
Title="Suodattimen säännöt tekstivalintaan"
ProgramFilename="Ohjelman tiedostonimi", "Ohjelman tiedostonimi (määritä kaikki ohjelmat, jos tyhjä)"
WndClassName="Ikkunan luokkanimi", "Ikkunan luokkanimi (määritä kaikki ikkunat, jos tyhjä)"
DisableSelect="Ohita tekstivalinta", "Ohita tekstivalinta"
DisableDBLClick="Ohita kaksoisklikkaus", "Ohita kaksoisklikkaus"
Comment="Kommentti", "Kommentti"
Add="Lisää"
Modify="Muokkaa"
Delete="Poista", "Haluatko varmasti poistaa nykyisen kohteen?"
Ok="Ok"
Cancel="Peruuta"
LoadDefault="Lataa oletus", "Oletko varma oletusasetusten palauttamisesta?"
Browser="...", "Selain", "Ohjelma (*.exe)|*.exe|"
Capture="...", "Ikkunan luokkanimen kaappaus"
AllProgram="-- Kaikki ohjelmat --"
AllWindow="-- Kaikki ikkunat --"

[WndClassNameCapture]
Title="Ikkunan luokkanimen kaappaus"
ProgramFilename="Ohjelman tiedostonimi"
WndClassName="Ikkunan luokkanimi"
Capture="Kaappaa se näytöltä"

; Speech
[DlgOptSpeech]
RPPEngine="Luonnollinen ääni"
RPPEnable="Käytä"
RPPVoice="Ääni"
RPPRebuildIndexFile="Jälleenrakenna indeksitiedosto", "Indeksitiedoston jälleenrakennus epäonnistui! \nEhkä sinulla ei ole riittäviä tiedostojen käyttöoikeuksia."
Engine="Teksti puheeksi (TTS)"
Voice="Ääni"
Enable="Käytä"
Volume="Voimakkuus"
Pitch="Sävelkorkeus"
Speed="Nopeus"
Format="Formaatti", "Oletus", "Älä tue ääniformaattia: [$Format]"
RealtimePron="Reaaliaikainen ääntäminen"
PronInQuery="Etsittäessä sanaa"
PronInCapture="Samalla kun kaapataan sanaa ruudulla"
PronInSelect="Samalla kun käännetään valittua tekstiä"
Test="Testi"
EnterText="Kirjoita teksti ja kokeile sitä"
DownloadTTS="Lataa luonnollisen äänen äänipaketti && TTS-moottori..."

; Connect
[DlgOptConnection]
ConnectSet="Yhteysasetus"
DirectConnect="Suora yhteys"
IEProxyConnect="Käytä selaimesi välityspalvelimen asetuksia"
ProxyConnect="Yhdistä välityspalvelimen kautta / Palomuuri-palvelin"
ProxyServer="Välityspalvelin:"
ProxyPort="Portti:"
Username="Käyttäjätunnus:"
Password="Salasana:"
OnlineUpdate="Verkkopäivitys"
UpdateNow="Päivitä nyt"
EnableUpdate="Ota käyttöön verkkopäivitys"

; Hotkey
[DlgOptHotkey]
OpenMainWnd="Avaa/Sulje pääikkuna"
GrabToggleKey="Käytä/Poista sanan kaappaus näytöllä"
SelectionToggleKey="Käytä/Poista valitun tekstin käännös"
ClipboardToggleKey="Käytä/Poista leikepöydän tekstin käännös"
Pronounce="Äännä"
CopyInterpretation="Kopioi käännöksen sisältö"
SpeakSelectedText="Puhu valittu teksti"
StopSpeak="Lopeta puhuminen"
DisableHotKey="Poista käytöstä pikanäppäimet"
OpenMiniWnd="Avaa/Sulje mini-ikkuna"
RollUpMiniWnd="Pienennä/Palauta mini-ikkuna"

[DlgExpire]
Title="Lingoes on vanhentunut"
Ok="Päivitä nyt"
Cancel="Poistu"
NetworkSettings="Verkon asetukset"
Support="Lingoes.net"
AskUpgrade="Nykyinen versio on vanhentunut, sinun on päivitettävä uuteen versioon! \nPäivitetäänkö uuteen versioon?"

[DlgAbout]
DlgTitle="About Lingoes"
; Version="Version: "
PortableEdition="Portable Edition"
Email="Email Address"
Website="Lingoes Website"
LicenseTo="This Product Is Licensed To:"
; LicenseID="ID: "

;----------- new --------
PersonalUser="Personal non-commercial user"
EvaluationUser="Tämä kokeiluversio on tarkoitettu ainoastaan arviointiin"
UserLicenseQuantity="[$Quantity] Käyttöoikeussopimus", "[$Quantity] Käyttöoikeussopimus ([$KeyNo]/[$Quantity])"
LicenseExpire="Käyttöoikeus päättyy [$Day] päivän jälkeen"
;----------- end -----------

[WebResult]
SpellingAlternatives="Vaihtoehtoisia kirjoitustapoja"
SpellChecker="Oikeinkirjoituksen tarkistus"
TextTranslation="Tekstin kääntäminen"
WebSearch="Verkkohaku"
MoreResults="Lisää tuloksia"
WaitSearch="Pyynnön hakutulokset..."
NoMatch="<div id='dict_result_nomatch' style=\"font-family:'[$TextFont]'; font-size:[$TextFontSize]pt; line-height:normal; padding:10; display:[$Display]\"><b> Osumia ei löytynyt \"<font color='#C00000'>[$SearchKey]</font>\".</b></div>"

[WebStartPage]
StartPageTpl="<table id='startpage' width='100%' height='100%' border='0' cellspacing='0' cellpadding='10' onselectstart='return false'><tr><td align='center' style=\"font-family: '[$Font]'; font-size: [$FontSize]pt; line-height: 1.2em\"><a href='app://homepage/'><img border='0' src='[$ImgPath]logomain.png' width='134' height='40' style='margin-bottom:50'></a></td></tr></table>"
HelpTip="Näin käytät Lingoesia"
DownDictTip="Lataa lisää sanakirjoja"
Intro="Tuki yli 80 kielen käännökseen<br>Kohdistin käännös, Tekstikäännös ja Teksti puheeksi"

[TextTranslation]
Title="Tekstikäännös"
To="kielelle"
Translate="Käännä"
RequestFailed="Käännöspalvelujen pyyntö epäonnistui."
ConnectFailed="Lingoes ei saanut yhteyttä palvelimeen. Jos olet yhteydessä Internetiin, tarkista yhteysasetukset."
WaitRequest="Käännöspyynnön tulokset..."
ParseResultFailed="Analysoi käännöksen virheet. Jos saat viestin useaampaan kertaan, ilmoita siitä meille."

; Layout
[Layout]
DictMenu="Sanakirjavalikko"
ShowResult="Näytä tulos"
MinimizeResult="Pienennä tulos"
FindWord="Hae: "
NoLicenseTip="Kaikki sisältö näytetään luvan saamisen jälkeen...", "Tämä sanakirjan kokeiluversio on vain arviointiin, koko sisältö näytetään luvan saamisen jälkeen: &nbsp;<a href='app://activate/'><u>Activate</u></a> &nbsp<a href='app://buy/[$ProductID]'><u>Hanki</u></a>", "Tämä sanakirjan kokeiluversio on vain arviointiin, koko sisältö näytetään luvan saamisen jälkeen: &nbsp;<a href='app://activate/'><u>Aktivoi</u></a> &nbsp<a href='app://buy/[$AppProductID]'><u>Hanki</u></a>"
RememberWord="Lisää sana muistioon"

; Dictionary Menu
[DictMenu]
About="Tietoja..."
Enable="Käytä"
Disable="Poista käytöstä"
DisableMsg="Sanakirja on pois käytöstä, eikä näytä tulosta! \nVoit ottaa sen käyttöön \"Sanakirjat\" valintaikkunassa."
MoveTop="Aseta parhaaksi tulokseksi"
ArrangeResults="Järjestä tulokset..."
IndexGroup="  (Indeksiryhmä)"
QueryGroup="  (Kyselyryhmä)"
GrabGroup="  (Tekstinkaappausryhmä)"

[Update]
Title="Verkkopäivitys"
AskUpgrade="Uusi versio havaittu. Haluatko päivittää uuteen versioon?"
UpgradeNow="Uusi versio havaittu. Haluatko päivittää uuteen versioon"
UpdateSuccess="Päivitys onnistui!"
UpdateFail="Päivitys epäonnistui!"
NoUpdate="Nykyinen versio on viimeisin"

CheckUpdate="Tarkistetaan päivitys..."
GetUpdateInfo="Haetaan päivitystiedot..."
DownUpdateData="Ladataan päivitetyt tiedot..."
ExecUpdate="Päivitetään järjestelmä..."
GetUpgradeInfo="Haetaan päivitystiedot..."
DownUpgradeData="Ladataan päivitetyt tiedot..."
ExecUpgrade="Päivitetään järjestelmä..."
NeedExitForUpgrade="Lingoes sulkeutuu päivityksen viimeistelemiseksi"

[Message]
InitUpdateServerFail="Virhe automaattisen päivityspalvelun alustuksessa"
StartDictServerFail="Käynnistyshäiriö sanakirjapalvelussa."

DictFileErr="Virheellinen tiedostomuoto!\n[$Filename]"
DictVersinTooOld="[$Filename]\nNykyisen sanakirjan versio ([$DictVer]) on liian vanha, päivitä se.\n\nKäy Lingoes verkkosivuilla etsimässä uusin versio?"
DictVersinTooNew="[$Filename]\nNykyisen sanakirjan versio ([$DictVer]) edellyttää uudempaa Lingoes-versiota.\n\nLataa uusin versio Lingoes-sivustolta nyt?"

AskDictRepeatInstall="Sanakirjaluettelo sisältää sanakirjan \"[$DictTitle]\",\nHaluatko jatkaa?"
InstallDictFail="Virhe sanakirjan asennuksessa:\n[$Filename]"
AskUninstall="Oletko varma että haluat poistaa sanakirjan?\n\n[$DictTitle]\nID: [$DictID]"
UninstallDictFail="Sanakirjan asennuksen poisto epäonnistui\n\n[$DictTitle]\nID: [$DictID]"
AskRemoveFromGroup="Oletko varma että haluat poistaa sanakirjan \"[$DictTitle]\" luettelosta?"

MemoryAllocFail="Muistin varaus epäonnistui."
FilenameInvalid="Virheellinen tiedostonimi."
SaveFileFail="Tiedoston tallennus epäonnistui"
OpenFileFail="Tiedoston avaus epäonnistui"

AreYouAbort="Haluatko varmasti keskeyttää nykyisen prosessin?"
CreateThreadFail="Säikeen luonti epäonnistui"
CreateEventFail="Tapahtumakahvan luonti epäonnistui"
Unfulfilment="Ominaisuus ei toimi"
OnlyProVersion="Ominaisuus on vain Pro-versiossa."
NoRegister="Rekisteröimätön versio, rekisteröi Lingoes käyttääksesi ominaisuutta."
UsernameIsEmpty="Käyttäjätunnus on tyhjä, täytä uudelleen."
SaveSearchResultFail="Virhe hakutuloksen tallennuksessa."

OpenAppendixFail="Liitesisällön avaus ei onnistunut.\n\nLataa liite Lingoes-sivustolta nyt?"
OpenSpeechEngineFail="Virhe TTS moottorin latauksessa, tarkista onko TTS on asennettu järjestelmään! \n\nSinun täytyy asentaa TTS moottori käyttöjärjestelmääsi. Lataa ja asenna se Lingoes-verkkosivuilta \n\nHaluatko ladata sen nyt?"

; NeedIE6Support="Lingoes needs Internet Explorer 6+, please update your web browser to IE6+"
NoImplement="Valitettavasti ominaisuus ei toimi"

InstallSucceed="Asennus onnistui." 
InstallFailed="Asennus epäonnistui."

[DlgOptLicense]
Product="Tuotteen lisenssoiminen"
Enter="Anna lisenssi..."
Remove="Poista lisenssi", "Lisenssin poistaminen saattaa estää tiettyjä ominaisuuksia,\nHaluatko jatkaa ja poistaa lisenssin seuraavista tuotteista:\n\n[$ProductList]"
Detail="Lisätietoja..."

LicenseID="Lisenssin ID: "
LicenseTo="Lisenssoitu: "
LicenseExpire="lisenssin voimassaolo päättyy [$Day] päivän kuluttua"
UserLicenseQuantity="[$Quantity] Käyttöoikeussopimus", "[$Quantity] Käyttöoikeussopimus ([$KeyNo]/[$Quantity])"

[DlgActivation]
Title="Anna lisenssi"
ActivateTitle="Syötä lisenssiavain", "Löydät lisenssiavaimen tilausvahvistuksen sähköpostissa tai asennuslevyn pidikeessä tuotepaketin sisällä."
LicenseKey="Lisenssiavain:"
Name="Nimesi:"
Email="Sähköposti:"
NetworkSet="Verkkoasetukset", "Aktivoidaksesi lisenssiavaimen sinun pitää olla verkossa. Ole hyvä ja aseta välityspalvelimen asetukset tarvittaessa."
Activate="Aktivoi"
BuyTitle="Hanki [$Publisher] tuote", "hankkiaksesi [$Publisher] tuotteen, klikkaa Osta-painiketta."
Buy="Osta"
Cancel="Sulje"

IncorrectProductKey="Lisenssiavain on virheellinen."
IncorrectName="Nimi on väärä. Anna nimi 32 merkin rajoissa"
IncorrectEmail="Sähköpostiosoite on virheellinen. Anna voimassa oleva sähköpostiosoite 128 merkkin rajoissa."
WaitRequest="Käsitellään... Odota."

RequestFailed="Aktivointi on epäonnistunut.Palvelin saattaa olla varattu. Yritä myöhemmin uudelleen."
NetworkFault="Aktivointipalvelimeen ei voi yhdistää, tarkista verkon asetukset."
ResponseError="Palvelimen vastaus on virheellinen."
OtherError="Tuntematon virhe."
SaveDataFailed="Tallennus epäonnistui"

ActivateSuccess="Aktivointi onnistui"
ActivateFailed="Aktivointi epäonnistui"

[WndTip]
Title="Lingoes päivän vinkki"
Close="Sulje"
